Repository: FPGAwars/iceCoders
Catalog: locale/*/*.po
Languages: es_es

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de 1-periodo (tic) cuando un flanco (de subida o de bajada) se detecta en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el anterior 0, o si el valor actual es 0 y el anterior 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: 04-Encoder-4-2-with-buttons-LEDs
es_es: 04-Codificador-4-2-con-Botones-LEDs

source: 4 FPGA internal pull-ups
es_es: 4 pull-ups internos de la FPGA

source: # Example: Manual testing of the Encoder-4-2-Bus-neg The four external buttons are encoded into 2-bits and displayed on the LEDs
es_es: # Ejemplo: Prueba manual del codificador 4-2-Bus-neg Los cuatro botones externos se codifican en 2-bits y se muestran en los LEDs

source: 05-Encoder-8-3-with-buttons-LEDs
es_es: 05-Codificador-8-3-con-botones-LEDs

source: 08-SR: 8 bits shift right register. Verilog implementation
es_es: 08-SR: Registro de desplazamiento a la derecha, de 8 bits. Implementación en Verilog

source: # Example: Manual testing of the Encoder-8-3 Send the pattern 00000000, 10000000, 01000000, 00100000, 00010000, 00001000, 00000100, 00000010, 00000001 to the enconder. The output is shown on the LEDs: 000 (nz=0), 111 (nz=1), 110 (nz=1), 101 (nz=1), 100 (nz=1), 011 (nz=1), 010 (nz=1), 001 (nz=1)
es_es: # Ejemplo: Prueba manual del codificador 8-3 Enviar el patrón 00000000, 10000000, 01000000, 00100000, 00010000, 00001000, 00000100, 00000010, 00000001 al codificador. La salida se muestra en los LEDs: 000 (nz=0), 111 (nz=1), 110 (nz=1), 101 (nz=1), 100 (nz=1), 011 (nz=1), 010 (nz=1), 001 (nz=1)

source: 3-bits Encoded number
es_es: Numero codificado de 3 bits

source: 8-bits Shift-register
es_es: Registro de desplazamiento de 8 bits

source: 06-Encoder-8-3-with-buttons-LEDs
es_es: 06-Codificador-8-3-con-botones-LEDs

source: 8 FPGA internal pull-ups
es_es: 8 pull-ups internas de la FPGA

source: # Example: Manual testing of the Encoder-8-3-Bus-neg The eight external buttons are encoded into 3-bits and displayed on the LEDs
es_es: # Ejemplo: Prueba manual del codificador 8-3-Bus-neg Los ocho botones externos se codifican en 3-bits y se muestran en los LEDs

source: 07-Decoder-1-2-button-LED
es_es: 07-Decodificador-1-2-Boton-LED

source: # Example: Decoder 1-2: Manual testing When the button is pressed, the LED1 is ON and the LED0 is OFF. When the buton not pressed, the LED1 is OFF and the LED0 is ON
es_es: # Ejemplo: Decodificador 1-2: Prueba manual Cuando el botón se aprieta, el LED1 se enciende y el LED0 se apaga. Cuando el botón no está apretado, el LED1 está apagado y el LED0 encendido

source: 08-Decoder-1-2-Bus-neg-button-LED
es_es: 08-Decodificador-1-2-Bus-neg-Boton-LED

source: # Example: Decoder 1-2-bus-neg: Manual testing When the button is pressed, the LED1 is OFF and the LED0 is ON. When the buton not pressed, the LED1 is ON and the LED0 is OFF
es_es: # Ejemplo: Decodificador 1-2-bus-neg: Prueba manual cuando el botón se aprieta, el LED1 se apaga y el LED0 se enciende. Cuando el botón no se aprieta, el LED1 se enciende y el LED0 se apaga

source: 09-Decoder-2-4-button-LEDs
es_es: 09-Decodificador-2-4-Boton-LEDs

source: # Example: Decoder 2-4: Manual testing
es_es: # Ejemplo: Decodificador 2-4: Prueba manual

source: 10-Decoder-2-4-Bus-neg-buttons-LEDs
es_es: 10-Decodificador-2-4-Bus-neg-boton-LEDs

source: # Example: Decoder 2-4-bus-neg: Manual testing
es_es: # Ejemplo: Decodificador 2-4-bus-neg: Prueba manual

source: Decoder 2-4-Bus-neg
es_es: Decodificador-2-4-Bus-neg

source: 11-Decoder-3-8-button-LEDs
es_es: 11-Decodificador-3-8-Boton-LEDs

source: Counter-x03: 3-bits counter
es_es: Counter-x03: Contador de 3 bits

source: Inc1-3bit: Increment a 3-bits number by one
es_es: Inc1-3bit: Incrementar un número de 3 bits en uno

source: AdderK-3bit: Adder of 3-bit operand and 3-bit constant
es_es: AdderK-3bit: Sumador de un operando y una constante de 3 bits

source: Generic: 3-bits generic constant (0-7)
es_es: Generic: Constante genérica de 3-bits (0-7)

source: Adder-3bits: Adder of two operands of 3 bits
es_es: Adder-3bits: Sumador de dos operandos de 3 bits

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Dividir el bus de 3-bits en tres cables

source: 03-Reg: 3 bits Register. Verilog implementation
es_es: 03-Reg: Registro de 3-bits. Implementación en Verilog

source: # Example: 3-8: Manual testing The numbers 0 - 7 are sent to the decoder. The decoded number is shown on LEDs 0 - 7. The number to decode is increased by 1 when the button is pressed
es_es: # Ejemplo: Decodificador 3-8: Prueba manual Los números 0-7 se envían al decodificador. El número decodificado se muestran en los LEDs 0 - 7. El número a decodificador se incrementa en 1 cada vez que se aprieta el botón

source: 3-bits counter
es_es: Contador de 3 bits

source: 3-8 Decoder
es_es: 3-8 Decodificador

source: 12-Decoder-3-8-bus-neg-buttons-LEDs
es_es: 12-Decodificador-3-8-bus-neg-botones-LEDs

source: # Example: Decoder 3-8-bus-neg: Manual testing
es_es: # Ejemplo: Decodificador 3-8-bus-neg: Prueba manual

source: Reg-x03: 3-bits register
es_es: Reg-x03: Registro de 3 bits

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (Canal de 1 bit). Versión invertida

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en Verilog)

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Se genera un pulso de 1-ciclo cuando se detecta un flanco de subida en la entrada

source: 1bit register (implemented in verilog)
es_es: Registro de 1 bit (implementado en Verilog)

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 Biestables De en paralelo con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres biestbles D en paralelo con reset

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestble D con entrada de reset. Cuando rst=1, el biestable es 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus 16-Split-quarter: Separar el bus de 16 bits en cuatro buses del mismo tamaño

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus 16-Join-quarter: Unir las cuatro buses en uno de 16-bits

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Genera un pulso de 1 ciclo (tic) cuando llega un flanco de subida o uno de bajada por la entrada

source: Sync 1-bit input with the system clock domain
es_es: Sincronizar la entrada de 1-bit con el dominio del reloj del sistema

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1-bit (0/1)

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activa a nivel alto Cuando rst = 1, el biestable D se inicializa a 0

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto: 0
