Repository: FPGAwars/iceCoders
Catalog: locale/*/*.po
Languages: es_es

source: Decoders
es_es: Decodificadores

source: Encoders
es_es: Codificadores

source: Decod-1-2
es_es: Decodificador-1-2

source: Decod-2-4
es_es: Decodificador-2-4

source: Decod-3-8
es_es: Decodificador-3-8

source: Decod-1-2-bus-neg
es_es: Decodificador-1-2bus-neg

source: Decoder-1-2-bus-neg: 1 to 2 decoder. Output bus. Active low
es_es: Decodificador-1-2-bus-neg: Decodificador de 1 a 2. Salida de Bus activa a nivel bajo

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Agrupar dos cables en un bus de 2-bits

source: not-x2: 2-bits not gate
es_es: not-x2: puerta NOT de 2-bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar el bus de 2-bits en dos cables

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Decoder-1-2: 1 to 2 decoder
es_es: Decoder-1-2: Decodificador de 1 a 2

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: ## Truth table |i | o1 | o0 | |---|-----|----| |0 | 0 | 1 | |1 | 1 | 0 |
es_es: ## Tabla de verdad |i | o1 | o0 | |---|-----|----| |0 | 0 | 1 | |1 | 1 | 0 |

source: Decod-1-2-bus
es_es: Decodificador-1-2-bus

source: Decoder-1-2-bus: 1 to 2 decoder. Output bus
es_es: Decoder-1-2-bus: Decodificador de 1 a 2. Salida de bus

source: Decod-1-2-neg
es_es: Decodificador-1-2-neg

source: Decoder-1-2: 1 to 2 decoder. The outputs are active low
es_es: Decoder-1-2: Decodificador de 1 a 2. Salidas activas a nivel bajo

source: ## Truth table |i | o1 | o0 | |---|-----|----| |0 | 1 | 0 | |1 | 0 | 1 |
es_es: ## Tabla de verdad |i | o1 | o0 | |---|-----|----| |0 | 1 | 0 | |1 | 0 | 1 |

source: Decod-1-2-verilog
es_es: Decodificador-1-2-verilog

source: Decoder-1-2: 1 to 2 decoder. Verilog implementation
es_es: Decoder-1-2: Decodificador de 1 a 2. Implementacion en Verilog

source: Decod-2-4-bus-neg
es_es: Decodificador-2-4-bus-neg

source: Decoder-2-4: 2 to 4 decoder. Output bus. Active low
es_es: Decoder-2-4: Decodificador de 2 a 4. Salida de bus activa a nivel bajo

source: not-x4: 4-bits not gate
es_es: not-x4: Puerta not de 4 bits

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Dividir el bus de 4-bits en sus cuatro cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4-bits

source: Decoder-2-4: 2 to 4 decoder. Output bus
es_es: Cecoder-2-4: Decodificador de 2 a 4. Salida de bus

source: Decoder-2-4: 2 to 4 binary decoder
es_es: Decodificador-2-4: Decodificador binario de 2 a 4

source: Two bits input And gate
es_es: Puerta AND de dos bits de entrada

source: ## Truth table | input | o3 | o2 | o1 | o0 | |--------|-----|----|----|----| | 00 | 0 | 0 | 0 | 1 | | 01 | 0 | 0 | 1 | 0 | | 10 | 0 | 1 | 0 | 0 | | 11 | 1 | 0 | 0 | 0 |
es_es: ## Tabla de verdad | Entrada | o3 | o2 | o1 | o0 | |--------|-----|----|----|----| | 00 | 0 | 0 | 0 | 1 | | 01 | 0 | 0 | 1 | 0 | | 10 | 0 | 1 | 0 | 0 | | 11 | 1 | 0 | 0 | 0 |

source: Decod-2-4-bus
es_es: Decodificador-2-4-bus

source: Decod-2-4-neg
es_es: Decodificador-2-4-neg

source: Decoder-2-4-neg: 2 to 4 decoder. The outputs are active low
es_es: Decoder-2-4-neg: Decodificador de 2 a 4. Salidas activas a nivel bajo

source: Decod-2-4-verilog
es_es: Decodificador-2-4-verilog

source: Decoder-2-4: 2 to 4 binary decoder. Verilog implementation
es_es: Decoder-2-4: Decodificador binario de 2 a 4. Implementación en Verilog

source: Decodificador de 3 a 5, lógica invertida, con salida en bus
es_es: Decodificador de 3 a 6, lógica invertida, con salida en bus

source: Decoder-3-8: 3 to 8 decoder. Output bus. Outputs are active low
es_es: Decoder-3-8: Decodificador de 3 a 8. Salida de bus activa a nivel bajo

source: not-x8: 8-bits not gate
es_es: not-x8: puerta NOT de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8 bits en dos buses del mismo tamaño

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar las dos mitades en un bus de 8 bits

source: Decoder-3-8: 3 to 8 decoder. Output bus
es_es: Decoder-3-8: Decodificador de 3 a 8. Salida de bus

source: Bus8-Join-all: Join all the wires into a 8-bits Bus
es_es: Bus8-Join-all: Agrupar todos los cables en un bus de 8-bits

source: Decoder-3-8: 3 to 8 decoder
es_es: Decoder-3-8: Decodificador de 3 a 8

source: Bus3-Split-1-2: Split the 3-bits bus into two: 1-bit and 2-bits buses
es_es: Bus3-Split-1-2: Separar el bus de 3-bits en dos buses de 1-bit y 2-bits

source: Decoder-2-4: 2 to 4 decoder
es_es: Decoder-2-4: Decodificador de 2 a 4

source: AND-Busen-4: Enable a 4-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-4: Habilitar un bus de 4-bits. Cuando la señal de enable es 0, la salida es 0

source: Active when the input is 4-7
es_es: Activo cuando la entrada es 4-7

source: Active when the input is 0-3
es_es: Activo cuando la salida es 0-3

source: ## Truth table | input | o7 | o6 | o5 | o4 | o3 | o2 | o1 | o0 | |---------|---------|--------|--------|--------|--------|-------|--------|--------| | 000 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | **1** | | 001 | 0 | 0 | 0 | 0 | 0 | 0 | **1** | 0 | | 010 | 0 | 0 | 0 | 0 | 0 | **1** | 0 | 0 | | 011 | 0 | 0 | 0 | 0 | **1** | 0 | 0 | 0 | | 100 | 0 | 0 | 0 | **1** | 0 | 0 | 0 | 0 | | 101 | 0 | 0 | **1** | 0 | 0 | 0 | 0 | 0 | | 110 | 0 | **1** | 0 | 0 | 0 | 0 | 0 | 0 | | 111 | **1** | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
es_es: ## Tabla de verdad | Entrada | o7 | o6 | o5 | o4 | o3 | o2 | o1 | o0 | |---------|---------|--------|--------|--------|--------|-------|--------|--------| | 000 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | **1** | | 001 | 0 | 0 | 0 | 0 | 0 | 0 | **1** | 0 | | 010 | 0 | 0 | 0 | 0 | 0 | **1** | 0 | 0 | | 011 | 0 | 0 | 0 | 0 | **1** | 0 | 0 | 0 | | 100 | 0 | 0 | 0 | **1** | 0 | 0 | 0 | 0 | | 101 | 0 | 0 | **1** | 0 | 0 | 0 | 0 | 0 | | 110 | 0 | **1** | 0 | 0 | 0 | 0 | 0 | 0 | | 111 | **1** | 0 | 0 | 0 | 0 | 0 | 0 | 0 |

source: Enable input
es_es: Entrada de habilitación

source: Bus input
es_es: Entrada de bus

source: Bus output
es_es: Salida de bus

source: Decod-3-8-bus
es_es: Decodificador-3-8-bus

source: Decod-3-8-neg
es_es: Decodificador-3-8-neg

source: Decoder-3-8: 3 to 8 decoder. Outputs are active low
es_es: Decoder-3-8: Decodificador de 3 a 8. Salidas activas a nivel bajo

source: Decod-3-8-verilog
es_es: Decodificador-3-8-verilog

source: Decoder-3-8: 3 to 8 decoder. Verilog implementation
es_es: Decoder-3-8: Decodificador de 3 a 8. Implementación en Verilog

source: Encoders-2-1
es_es: Codificadores-2-1

source: Encoders-4-2
es_es: Codificadores-4-2

source: Encoders-8-3
es_es: Codificadores-8-3

source: encoder-2-1-bus-neg
es_es: codificador-2-1-bus-neg

source: A 2-to-1 encoder with active low inputs in a bus and nz (not-zero) output
es_es: Un Codificador 2-1 con entrdas activas a nivel bajo en un bus, y salida nz (not-zero)

source: A 2-to-1 encoder with bus inputs and nz (not-zero) output
es_es: Un codificador 2-1 con entrdas de bus y salida nz (not-zero)

source: A standard 2-to-1 encoder with nz (not-zero) output
es_es: Un codificador estándarrd 2-1 con salida nz (not-zero)

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de entrada de 2 bits

source: Encoder-2-1
es_es: Codificador-2-1

source: 2-1 Encoder
es_es: 2-1 Codificador

source: ## Truth table | i1 | i0 | out | nz | |----|----|-----|----| | 0 | 0 | 0 | 0 | | 0 | 1 | 0 | 1 | | 1 | 0 | 1 | 1 | | 1 | 1 | 1 | 1 |
es_es: ## Tabla de verdad | i1 | i0 | out | nz | |----|----|-----|----| | 0 | 0 | 0 | 0 | | 0 | 1 | 0 | 1 | | 1 | 0 | 1 | 1 | | 1 | 1 | 1 | 1 |

source: encoder-2-1-bus
es_es: codificador-2-1-bus

source: encoder-2-1-neg
es_es: codificador-2-1-neg

source: A 2-to-1 encoder with active low inputs and nz (not-zero) output
es_es: Un codificador 2-1 con entradas activas a nivel bajo y salida nz (not-zero)

source: ## Truth table | i1 | i0 | out | nz | Description | |----|----|-----|----|----| | 1 | 1 | 0 | 0 | No active inputs | | 1 | 0 | 0 | 1 | Input 0 active | | 0 | 1 | 1 | 1 | Input 1 active | | 0 | 0 | 1 | 1 | Input 1 active |
es_es: ## Tabla de verdad | i1 | i0 | out | nz | Descripción | |----|----|-----|----|----| | 1 | 1 | 0 | 0 | Ninguna entrada activa | | 1 | 0 | 0 | 1 | Entrada 0 activa | | 0 | 1 | 1 | 1 | Entrada 1 activa | | 0 | 0 | 1 | 1 | Entrada 1 activa |

source: encoder-2-1-verilog
es_es: codificador-2-1-verilog

source: A standard 2-to-1 encoder with nz (not-zero) output. Implemented in verilog
es_es: Un codificador estándarrd 2-1 con salida nz (not-zero). Implementado en verilog

source: encoder-2-1
es_es: codificador-2-1

source: Encoder-4-2-Bus-neg
es_es: Codificador-4-2-Bus-neg

source: 4 to 2 binary Enconder with priority. Input and output Buses. Low active inputs
es_es: Codificador binario 4-2 con prioridad. Buses de entrada y salida. Entradas activas a nivel bajo

source: 4 to 2 binary Enconder with priority. Input and output Buses
es_es: Codificador binario 4-2 con prioridad. Buses de entrada y salida

source: 4 to 2 binary Enconder with priority
es_es: Decodificador binario 4-2 con prioridad

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (canales de 1 bit)

source: Encoder-4-2-Bus
es_es: Codificador-4-2-Bus

source: Encoder-4-2-Verilog
es_es: Condificador-4-2-Verilog

source: 4 to 2 binary Enconder with priority. Verilog implementation
es_es: Codificador binario 4-2 con prioridad. Implementaión en verilog

source: Encoder-4-2-neg
es_es: Codificador-4-2-neg

source: 4 to 2 binary Enconder with priority. Low active inputs
es_es: Codificador binario 4-2 con prioridad. Entradas activas a nivel bajo

source: Encoder-4-2
es_es: Codificador-4-2

source: Encoder-8-3-Bus-neg
es_es: Codificador-8-3-Bus-neg

source: 8 to 3 binary Enconder with priority. Active low inputs. Input and Output buses
es_es: Codificador binario 8-3 con prioridad. Entradas activas a nivel bajo. Entradas y salidas de bus

source: 8 to 3 binary Enconder with priority. Input and Output buses
es_es: Codificador binario 8-3 con prioridad. Buses de entrada y salida

source: 8 to 3 binary Enconder with priority
es_es: Codificador binario 8-3 con prioridad

source: 2-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 2-1 (canales de 2 bits)

source: Bus8-Split-all: Split the 8-bits bus into its wires
es_es: Bus8-Split-all: Separar el bus de 8 bits en sus 8 cables

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus3-Join-all: Agrupar tres cables en un bus de 3-bits

source: Channel A
es_es: Canal A

source: Channel B
es_es: Canal B

source: Encoder-8-3-Bus
es_es: Codificador-8-3-Bus

source: Encoder-8-3-neg
es_es: Codificador-8-3-neg

source: 8 to 3 binary Enconder with priority. Active low inputs
es_es: Codificador binario 8-3 con prioridad. Entradas activas a nivel bajo

source: Encoder-8-3-verilog
es_es: Codificador-8-3-verilog

source: 8 to 3 binary Enconder with priority. Implemented in Verilog
es_es: Codificador binario 8-3 con prioridad. Implementado en verilog

source: Encoder-8-3
es_es: Codificador-8-3

source: 01-Encoder-2-1
es_es: 01-Codificador-2-1

source: 02-Encoder-2-1-Bus-neg
es_es: 02-Codificador-2-1-Bus-neg

source: 03-Encoder-4-2
es_es: 03-Codificador-4-2

source: 04-Encoder-4-2-Bus-neg
es_es: 04-Codificador-4-2-Bus-neg

source: 05-Encoder-8-3
es_es: 05-Codificador-8-3

source: 06-Encoder-8-3-Bus-neg
es_es: 06-Codificador-8-3-Bus-neg

source: 07-Decoder-1-2
es_es: 07-Decodificador-1-2

source: 08-Decoder-1-2-Bus-neg
es_es: 08-Decodificador-1-2-Bus-neg

source: 09-Decoder-2-4
es_es: 09-Decodificador-2-4

source: 10-Decoder-2-4-Bus-neg
es_es: 10-Decodificador-2-4-Bus-neg

source: 11-Decoder-3-8
es_es: 11-Decodificador-3-8

source: 12-Decoder-3-8
es_es: 12-Decodificador-3-8

source: ## DECODERS
es_es: ## DECODIFICADORES

source: **Decoder-1-2**
es_es: **Decodificador-1-2**

source: **Decoder-1-2-neg**
es_es: **Decodificador-1-2-neg**

source: **Decoder-1-2-Bus**
es_es: **Decodificador-1-2-Bus**

source: **Decoder-1-2-Bus-neg**
es_es: **Decodificador-1-2-Bus-neg**

source: **Decoder-2-4**
es_es: **Decodificador-2-4**

source: **Decoder-2-4-neg**
es_es: **Decodificador-2-4-neg**

source: **Decoder-2-4-Bus**
es_es: **Decodificador-2-4-Bus**

source: **Decoder-2-4-Bus-neg**
es_es: **Decodificador-2-4-Bus-neg**

source: **Decoder-3-8**
es_es: **Decodificador-3-8**

source: **Decoder-3-8-neg**
es_es: **Decodificador-3-8-neg**

source: **Decoder-3-8-bus**
es_es: **Decodificador-3-8-bus**

source: **Decoder-3-8-bus-neg**
es_es: **Decodificador-3-8-bus-neg**

source: ## ENCODERS
es_es: ## CODIFICADORES

source: **Encoder 2-1**
es_es: **Codificador 2-1**

source: **Encoder 2-1-bus**
es_es: **Codificador 2-1-bus**

source: **Encoder 2-1-neg**
es_es: **Codificador 2-1-neg**

source: **Encoder 2-1-bus-neg**
es_es: **Codificador 2-1-bus-neg**

source: **Encoder 4-2**
es_es: **Codificador 4-2**

source: **Encoder 4-2-Bus**
es_es: **Codificador 4-2-Bus**

source: **Encoder 4-2-Neg**
es_es: **Codificador 4-2-Neg**

source: **Encoder 4-2-Bus-eg**
es_es: **Codificador 4-2-Bus-eg**

source: **Encoder-3-8**
es_es: **Codificador-3-8**

source: **Encoder-3-8-neg**
es_es: **Codificador-3-8-neg**

source: **Encoder 8-3-Bus**
es_es: **Codificador 8-3-Bus**

source: **Encoder 8-3-Bus-eg**
es_es: **Codificador 8-3-Bus-neg**

source: 01-Enconder-2-1-buttons-LEDs
es_es: 01-Codificador-2-1-Boton-LEDs

source: ## Example: Manual testing of the 2-to-1 Encoder Two pushbuttons are used as the inputs of the 2-to-1 enconder. The codified output (1-bit) is shown on LED7 and the nz output on LED0
es_es: ## Ejemplo: Prueba manual del Codificador 2-1 Dos pulsadores se usan como las entradas del codificador 2-1. La salida codificada (1-bit) se muestra en el LED7 y la salida nz en el LED0

source: Ouput: 1-bit
es_es: Salida: 1-bit

source: Active if any input is active
es_es: Activo si alguna entrada está activada

source: **2-1 Encoder**
es_es: **2-1 Codificador**

source: Input 1
es_es: Entrada 1

source: Input 0
es_es: Entrada 0

source: 02-Encoder-2-1-Bus-neg-with-buttons-LEDs
es_es: 02-Codificador-2-1-Bus-neg-con-botones-LEDs

source: Pull-upx2_ICE40: 2 internal pull-up configuration on the input port. ICE40 FPGA family
es_es: Pull-upx2_ICE40: Configuración de dos pull-up internas en el puerto de entrada. Familia de FPGA ICE40

source: Pull-up_ICE40:: FPGA internal pull-up configuration on the input port. ICE40 FPGA family
es_es: Pull-up_ICE40:: Configuración del pull-up interno de la FPGA en el puerto de entrada. FPGAs de la familia ICE40

source: # Example: Manual testing of the Encoder-2-1-Bus-neg It works exactly as the example 1, but the buttons are external (connected with pull-ups) and connected by a 2-bits bus
es_es: # Ejemplo: Prueba manual del codificador 2-1-Bus-neg Funciona exactamente igual que el ejemplo 1, pero los botones son externos (conectados con pull-ups) y conectados a través de un bus de 2 -bits

source: Buttons
es_es: Botones

source: Encoder-2-1-bus-neg
es_es: Codificador-2-1-bus-neg

source: The pull-ups are connected by default
es_es: Los pull-ups están conectados por defecto

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pullup: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo se puede conectar aquí un pin de la FPGA!!!

source: The pull-up is connected by default
es_es: El pull-up está conectado por defecto

source: 03-Encoder-2-4-with-buttons-LEDs
es_es: 03-Codificador-2-4-con-botones-LEDs

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input. Block implementation
es_es: Detector de flanco de subida. Se genera un pulso de 1-ciclo cuando se detecta un flanco de subida en la entrada. Implementación con bloques

source: System - D Flip-flop. Capture data every system clock cycle. Verilog implementation
es_es: Biestable D del sistema. Captura el data en cada ciclo del sistema. Implementación en verilog

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. NOT on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración de los pull-ups internos de la FPGA en el puerto de entrada

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: XOR gate: two bits input xor gate
es_es: XOR gate: Puerta XOR de dos bits de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar el rebote en un conmutador mecánico

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input. Block implementation
es_es: Detector de flancos. Genera un pulso de 1 ciclo (tic) cuando llega un flanco de subida o uno de bajada por la entrada. Implementación con bloques

source: DFF. D Flip-flop. Verilog implementation
es_es: DFF. Biestable D (Implementación en Verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16 bits con reset

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16-bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Generic: Constante genérica de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Dividir el bus de 16 bits en dos buses del mismo tamaño

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bit: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: Constant bit 0
es_es: Bit 0 constante

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bit: Sumador de dos operandos de 4 bit más el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bit: Sumador de dos operandos de 8 bit más el acarreo de entrada

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus 16-Join-half: Unir las dos mitades en un bus de 16-bits

source: 16-Sys-reg-rst: 16 bits system register with reset. Verilog implementation
es_es: 16-Sys-reg-rst: Registro del sistema de 16 bits con entradas de reset. Implementación en Verilog

source: Sync-x01: 1-bit input with the system clock domain (Verilog implementation)
es_es: Sync-x01: Sincronizar una entrada de 1-bit con el reloj del sistema (Implementación en verilog)

source: # Example: Manual testing of the Encoder-4-2 Send the pattern 0000, 0001, 0010, 0100, 1000 to the enconder. The output is shown on the LEDs: 00 (nz=0), 00 (nz=1), 01 (nz=1), 10 (nz=1), 11 (nz=1)
es_es: # Ejemplo: Prueba manual del codificador 4-2 Enviar el patrón 0000, 0001, 0010, 0100, 1000 al codificador. La salida se muestra en los LEDs: 00 (nz=0), 00 (nz=1), 01 (nz=1), 10 (nz=1), 11 (nz=1)

source: Generate the bit pattern, with a shift register
es_es: Generar el patrón de bits, con un registro de desplazamiento

source: 2-bits Encoded number
es_es: Número codificado de 2-bits

source: System clock
es_es: Reloj del sistema

source: Button state signal
es_es: Señal de estado del Pulsador

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: Pull up on/off
es_es: Pull up activada/desactivada

source: Not on/off
es_es: Not activada/desactivada

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un pulso de un periodo (tic) cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado actual de la señal

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo previo de reloj

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y sus valor en el ciclo anterior era 0, significa que se ha detectad un flanco de subida! Salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Delay**: 0 ciclos de reloj No hay retraso entre la llegada del flanco de subida y su detección

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Datos de entrada

source: # D Flip-Flop (system) It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D (Sistema) Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: Not connected
es_es: Sin conectar

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: Apagado * 1: Activado

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Etapa antirrebotes

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, se comporta como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad de la XOR | k | Entrada | Salida | Función | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: En cuanto hay un cambio en la entrada, el contador se arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su máximo valor, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo del tiempo Para CLK=12MHZ, un contador de 16-bits alcanza su máximo cada 2 ** 16 * 1/F = 5.5ms aprox Si se necesita más tiempo para el antirrebotes, usar un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox. Cuando un valor es estable se captura en la salida del Biestable

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador
